status/src/2023/0421.org
#+TITLE: 15 April 2023 - 21 April 2023

* MIT OCW
** 18.03sc (differential equations).
*** Unit I - Linear vs. Non-Linear Eq.
* Compilers
** Started hand written WSN parser
* Annie's Pottery Wheel
Bat pins shortened.
* Mill Controller #2
** Mounted on mill - ready or testing
** Need to investigate new HW/SW for eventual replacements
*** Old crap ain't gonna last forever
*** Buildroot/Linux 5.15 PREEMPT + latency tools
First pass done - boots on real hardware
** Alternative architecture
*** Split off stepper motor controller to separate board
Increase latency tolerance on controller
*** Use emc2 MODBUS/TCP protocol for stepper and other IO
* Alum Rock Data Center
** need to check rocky, others? (arch?) for suitability
** recheck ALMA, now that CERN and Fermilab are using it
** Sonic.net has announced that Fiber connectivity is coming to my house
** The end of DSL and static IP addresses as I know it
Started with Northpoint communications in the late 1990's. I guess
that's a good long run.
** Need a VPS with static IP
*** OpenVPN to tie it all together
*** Gandi VPS datacenter in France so connection crosses international border
What are the data security and privacy tradeoffs?
*** Prototype VPS on existing hardware
* CA Root Key Generation
Nice to have an appliance that manages keys. Simple hardware. USB Serial
interface only but no credentials across USB I/F.
** Beagleboard
Need to find!
** LCD Touchscreen
Unlocks encrypted filesystem.
** Encrypted Filesystem
* Virtual Orchestra
** sfz file tests
*** need tooling to edit sample files
