status/2023/0421.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>15 April 2023 - 21 April 2023</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">15 April 2023 - 21 April 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4da23b1">1. MIT OCW</a>
<ul>
<li><a href="#org0ca85fa">1.1. 18.03sc (differential equations).</a>
<ul>
<li><a href="#org5c323c5">1.1.1. Unit I - Linear vs. Non-Linear Eq.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org27027f1">2. Compilers</a>
<ul>
<li><a href="#org0cc061c">2.1. Started hand written WSN parser</a></li>
</ul>
</li>
<li><a href="#org612a19a">3. Annie's Pottery Wheel</a></li>
<li><a href="#org2099d8e">4. Mill Controller #2</a>
<ul>
<li><a href="#org0e95481">4.1. Mounted on mill - ready or testing</a></li>
<li><a href="#org709fb77">4.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org444eb40">4.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgddb3624">4.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#orga1d9df7">4.3. Alternative architecture</a>
<ul>
<li><a href="#org9d92d30">4.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#orgc0b985e">4.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd0e5f67">5. Alum Rock Data Center</a>
<ul>
<li><a href="#orge9192a2">5.1. need to check rocky, others? (arch?) for suitability</a></li>
<li><a href="#orgaf3e704">5.2. recheck ALMA, now that CERN and Fermilab are using it</a></li>
<li><a href="#org0ddcc96">5.3. Sonic.net has announced that Fiber connectivity is coming to my house</a></li>
<li><a href="#orgee4e8da">5.4. The end of DSL and static IP addresses as I know it</a></li>
<li><a href="#org9222003">5.5. Need a VPS with static IP</a>
<ul>
<li><a href="#orgbe0fec0">5.5.1. OpenVPN to tie it all together</a></li>
<li><a href="#orgd0a1cda">5.5.2. Gandi VPS datacenter in France so connection crosses international border</a></li>
<li><a href="#org9876776">5.5.3. Prototype VPS on existing hardware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgedcee9a">6. CA Root Key Generation</a>
<ul>
<li><a href="#orge6fc13e">6.1. Beagleboard</a></li>
<li><a href="#org31a9832">6.2. LCD Touchscreen</a></li>
<li><a href="#org666ec4c">6.3. Encrypted Filesystem</a></li>
</ul>
</li>
<li><a href="#org1d12c47">7. Virtual Orchestra</a>
<ul>
<li><a href="#orgeaeef9a">7.1. sfz file tests</a>
<ul>
<li><a href="#orgb62904a">7.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org62ee6d3">7.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#orgbda4963">7.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org1cee9b1">7.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#orgd528e07">8. gat</a>
<ul>
<li><a href="#orgf62f333">8.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org0ef82d1">9. RIOT drivers</a>
<ul>
<li><a href="#org2eea475">9.1. WS2801</a></li>
<li><a href="#orgb7c0e04">9.2. Velleman KA03</a></li>
<li><a href="#org87304e6">9.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org88557f9">10. mcd05 32 button/led box</a>
<ul>
<li><a href="#orge7f7622">10.1. Recovered schematics.</a></li>
<li><a href="#org5771d9e">10.2. Planning software.</a></li>
<li><a href="#org5094008">10.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#orgedf4a05">10.3.1. Test program running.</a></li>
<li><a href="#org5a4e284">10.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org2e05de5">10.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#org3e6637d">10.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org500be15">11. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#orgf58fcd9">11.1. Probably my oldest uncompleted project</a></li>
<li><a href="#org9c04951">11.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#orgb876169">12. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#orgc37264f">12.1. RAM/UART/IO</a></li>
<li><a href="#org73e4efe">12.2. Started schematic</a>
<ul>
<li><a href="#orgde99e6f">12.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#orgadf6172">12.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#org797d69f">12.4. Generate quadrature clock directly</a></li>
<li><a href="#org7b0ad65">12.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#org15c4bc9">13. Rockwell R65F11</a>
<ul>
<li><a href="#org4688274">13.1. Still evaluating.</a></li>
<li><a href="#orgdf8e111">13.2. Dev board</a></li>
</ul>
</li>
<li><a href="#org2025e8c">14. PLD programming</a></li>
<li><a href="#orga2e3d84">15. EPROM Programming</a></li>
<li><a href="#orgf9cb1ca">16. POSIT</a></li>
<li><a href="#org6325470">17. MAME</a>
<ul>
<li><a href="#org2b88338">17.1. Subset builds in debug mode</a></li>
<li><a href="#org79c0a7e">17.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#org6f6bbb9">17.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#orgbce051e">17.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#org7653290">18. More project ideas</a>
<ul>
<li><a href="#orgdb7f845">18.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org495d806">18.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#org4c028c6">18.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org3e2ef17">18.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org75e7293">18.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org418cf4f">18.3. GMPASM assembler</a></li>
<li><a href="#orgad9f594">18.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org562a3e2">18.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgc838d06">18.5.1. Offline compilation</a></li>
<li><a href="#org16fb755">18.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org3ad62d8">18.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org10c1476">18.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#orga613a97">18.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org4926a7c">18.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#org4dd3ab6">18.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#org6e2e675">18.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org9f46ebd">18.7.1. OSI Superboard</a></li>
<li><a href="#orgf4477c5">18.7.2. Super Jolt</a></li>
<li><a href="#orgc0a87a3">18.7.3. Ampro Little Board</a></li>
<li><a href="#org344c194">18.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgbbd99d7">18.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd47695f">19. David Davies</a>
<ul>
<li><a href="#orgf90477e">19.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org29219cd">19.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org8022209">19.3. Next hearing 3/30/2023</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4da23b1" class="outline-2">
<h2 id="org4da23b1"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0ca85fa" class="outline-3">
<h3 id="org0ca85fa"><span class="section-number-3">1.1.</span> 18.03sc (differential equations).</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5c323c5" class="outline-4">
<h4 id="org5c323c5"><span class="section-number-4">1.1.1.</span> Unit I - Linear vs. Non-Linear Eq.</h4>
</div>
</div>
</div>
<div id="outline-container-org27027f1" class="outline-2">
<h2 id="org27027f1"><span class="section-number-2">2.</span> Compilers</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0cc061c" class="outline-3">
<h3 id="org0cc061c"><span class="section-number-3">2.1.</span> Started hand written WSN parser</h3>
</div>
</div>
<div id="outline-container-org612a19a" class="outline-2">
<h2 id="org612a19a"><span class="section-number-2">3.</span> Annie's Pottery Wheel</h2>
<div class="outline-text-2" id="text-3">
<p>
Bat pins shortened.
</p>
</div>
</div>
<div id="outline-container-org2099d8e" class="outline-2">
<h2 id="org2099d8e"><span class="section-number-2">4.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0e95481" class="outline-3">
<h3 id="org0e95481"><span class="section-number-3">4.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-org709fb77" class="outline-3">
<h3 id="org709fb77"><span class="section-number-3">4.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org444eb40" class="outline-4">
<h4 id="org444eb40"><span class="section-number-4">4.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgddb3624" class="outline-4">
<h4 id="orgddb3624"><span class="section-number-4">4.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-orga1d9df7" class="outline-3">
<h3 id="orga1d9df7"><span class="section-number-3">4.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org9d92d30" class="outline-4">
<h4 id="org9d92d30"><span class="section-number-4">4.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-orgc0b985e" class="outline-4">
<h4 id="orgc0b985e"><span class="section-number-4">4.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-orgd0e5f67" class="outline-2">
<h2 id="orgd0e5f67"><span class="section-number-2">5.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge9192a2" class="outline-3">
<h3 id="orge9192a2"><span class="section-number-3">5.1.</span> need to check rocky, others? (arch?) for suitability</h3>
</div>
<div id="outline-container-orgaf3e704" class="outline-3">
<h3 id="orgaf3e704"><span class="section-number-3">5.2.</span> recheck ALMA, now that CERN and Fermilab are using it</h3>
</div>
<div id="outline-container-org0ddcc96" class="outline-3">
<h3 id="org0ddcc96"><span class="section-number-3">5.3.</span> Sonic.net has announced that Fiber connectivity is coming to my house</h3>
</div>
<div id="outline-container-orgee4e8da" class="outline-3">
<h3 id="orgee4e8da"><span class="section-number-3">5.4.</span> The end of DSL and static IP addresses as I know it</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Started with Northpoint communications in the late 1990's. I guess
that's a good long run.
</p>
</div>
</div>
<div id="outline-container-org9222003" class="outline-3">
<h3 id="org9222003"><span class="section-number-3">5.5.</span> Need a VPS with static IP</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orgbe0fec0" class="outline-4">
<h4 id="orgbe0fec0"><span class="section-number-4">5.5.1.</span> OpenVPN to tie it all together</h4>
</div>
<div id="outline-container-orgd0a1cda" class="outline-4">
<h4 id="orgd0a1cda"><span class="section-number-4">5.5.2.</span> Gandi VPS datacenter in France so connection crosses international border</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
What are the data security and privacy tradeoffs?
</p>
</div>
</div>
<div id="outline-container-org9876776" class="outline-4">
<h4 id="org9876776"><span class="section-number-4">5.5.3.</span> Prototype VPS on existing hardware</h4>
</div>
</div>
</div>
<div id="outline-container-orgedcee9a" class="outline-2">
<h2 id="orgedcee9a"><span class="section-number-2">6.</span> CA Root Key Generation</h2>
<div class="outline-text-2" id="text-6">
<p>
Nice to have an appliance that manages keys. Simple hardware. USB Serial
interface only but no credentials across USB I/F.
</p>
</div>
<div id="outline-container-orge6fc13e" class="outline-3">
<h3 id="orge6fc13e"><span class="section-number-3">6.1.</span> Beagleboard</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Need to find!
</p>
</div>
</div>
<div id="outline-container-org31a9832" class="outline-3">
<h3 id="org31a9832"><span class="section-number-3">6.2.</span> LCD Touchscreen</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Unlocks encrypted filesystem.
</p>
</div>
</div>
<div id="outline-container-org666ec4c" class="outline-3">
<h3 id="org666ec4c"><span class="section-number-3">6.3.</span> Encrypted Filesystem</h3>
</div>
</div>
<div id="outline-container-org1d12c47" class="outline-2">
<h2 id="org1d12c47"><span class="section-number-2">7.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgeaeef9a" class="outline-3">
<h3 id="orgeaeef9a"><span class="section-number-3">7.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgb62904a" class="outline-4">
<h4 id="orgb62904a"><span class="section-number-4">7.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
