status/2023/0421.html
<div id="outline-container-org62ee6d3" class="outline-3">
<h3 id="org62ee6d3"><span class="section-number-3">7.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-orgbda4963" class="outline-3">
<h3 id="orgbda4963"><span class="section-number-3">7.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org1cee9b1" class="outline-3">
<h3 id="org1cee9b1"><span class="section-number-3">7.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-7-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd528e07" class="outline-2">
<h2 id="orgd528e07"><span class="section-number-2">8.</span> gat</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgf62f333" class="outline-3">
<h3 id="orgf62f333"><span class="section-number-3">8.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org0ef82d1" class="outline-2">
<h2 id="org0ef82d1"><span class="section-number-2">9.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-9">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-org2eea475" class="outline-3">
<h3 id="org2eea475"><span class="section-number-3">9.1.</span> WS2801</h3>
</div>
<div id="outline-container-orgb7c0e04" class="outline-3">
<h3 id="orgb7c0e04"><span class="section-number-3">9.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-org87304e6" class="outline-3">
<h3 id="org87304e6"><span class="section-number-3">9.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org88557f9" class="outline-2">
<h2 id="org88557f9"><span class="section-number-2">10.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orge7f7622" class="outline-3">
<h3 id="orge7f7622"><span class="section-number-3">10.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org5771d9e" class="outline-3">
<h3 id="org5771d9e"><span class="section-number-3">10.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org5094008" class="outline-3">
<h3 id="org5094008"><span class="section-number-3">10.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-10-3">
</div>
<div id="outline-container-orgedf4a05" class="outline-4">
<h4 id="orgedf4a05"><span class="section-number-4">10.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org5a4e284" class="outline-4">
<h4 id="org5a4e284"><span class="section-number-4">10.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org2e05de5" class="outline-4">
<h4 id="org2e05de5"><span class="section-number-4">10.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-org3e6637d" class="outline-4">
<h4 id="org3e6637d"><span class="section-number-4">10.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-org500be15" class="outline-2">
<h2 id="org500be15"><span class="section-number-2">11.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgf58fcd9" class="outline-3">
<h3 id="orgf58fcd9"><span class="section-number-3">11.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-org9c04951" class="outline-3">
<h3 id="org9c04951"><span class="section-number-3">11.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-orgb876169" class="outline-2">
<h2 id="orgb876169"><span class="section-number-2">12.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgc37264f" class="outline-3">
<h3 id="orgc37264f"><span class="section-number-3">12.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-org73e4efe" class="outline-3">
<h3 id="org73e4efe"><span class="section-number-3">12.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-12-2">
</div>
<div id="outline-container-orgde99e6f" class="outline-4">
<h4 id="orgde99e6f"><span class="section-number-4">12.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-12-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-orgadf6172" class="outline-3">
<h3 id="orgadf6172"><span class="section-number-3">12.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-12-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-org797d69f" class="outline-3">
<h3 id="org797d69f"><span class="section-number-3">12.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-org7b0ad65" class="outline-3">
<h3 id="org7b0ad65"><span class="section-number-3">12.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-12-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org15c4bc9" class="outline-2">
<h2 id="org15c4bc9"><span class="section-number-2">13.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org4688274" class="outline-3">
<h3 id="org4688274"><span class="section-number-3">13.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-orgdf8e111" class="outline-3">
<h3 id="orgdf8e111"><span class="section-number-3">13.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-13-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
<div id="outline-container-org2025e8c" class="outline-2">
<h2 id="org2025e8c"><span class="section-number-2">14.</span> PLD programming</h2>
<div class="outline-text-2" id="text-14">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-orga2e3d84" class="outline-2">
<h2 id="orga2e3d84"><span class="section-number-2">15.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-15">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-orgf9cb1ca" class="outline-2">
<h2 id="orgf9cb1ca"><span class="section-number-2">16.</span> POSIT</h2>
<div class="outline-text-2" id="text-16">
<p>
Use POSITs for YRX?
</p>
</div>
</div>
<div id="outline-container-org6325470" class="outline-2">
<h2 id="org6325470"><span class="section-number-2">17.</span> MAME</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org2b88338" class="outline-3">
<h3 id="org2b88338"><span class="section-number-3">17.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-org79c0a7e" class="outline-3">
<h3 id="org79c0a7e"><span class="section-number-3">17.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-org6f6bbb9" class="outline-3">
<h3 id="org6f6bbb9"><span class="section-number-3">17.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-orgbce051e" class="outline-3">
<h3 id="orgbce051e"><span class="section-number-3">17.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-org7653290" class="outline-2">
<h2 id="org7653290"><span class="section-number-2">18.</span> More project ideas</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgdb7f845" class="outline-3">
<h3 id="orgdb7f845"><span class="section-number-3">18.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-org495d806" class="outline-3">
<h3 id="org495d806"><span class="section-number-3">18.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-18-2">
</div>
<div id="outline-container-org4c028c6" class="outline-4">
<h4 id="org4c028c6"><span class="section-number-4">18.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org3e2ef17" class="outline-4">
<h4 id="org3e2ef17"><span class="section-number-4">18.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-18-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-org75e7293" class="outline-4">
<h4 id="org75e7293"><span class="section-number-4">18.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org418cf4f" class="outline-3">
<h3 id="org418cf4f"><span class="section-number-3">18.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-18-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orgad9f594" class="outline-3">
<h3 id="orgad9f594"><span class="section-number-3">18.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org562a3e2" class="outline-3">
<h3 id="org562a3e2"><span class="section-number-3">18.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-18-5">
</div>
<div id="outline-container-orgc838d06" class="outline-4">
<h4 id="orgc838d06"><span class="section-number-4">18.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org16fb755" class="outline-4">
<h4 id="org16fb755"><span class="section-number-4">18.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org3ad62d8" class="outline-3">
<h3 id="org3ad62d8"><span class="section-number-3">18.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-18-6">
</div>
<div id="outline-container-org10c1476" class="outline-4">
<h4 id="org10c1476"><span class="section-number-4">18.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-orga613a97" class="outline-4">
<h4 id="orga613a97"><span class="section-number-4">18.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org4926a7c" class="outline-4">
<h4 id="org4926a7c"><span class="section-number-4">18.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org4dd3ab6" class="outline-4">
<h4 id="org4dd3ab6"><span class="section-number-4">18.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-org6e2e675" class="outline-3">
<h3 id="org6e2e675"><span class="section-number-3">18.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-18-7">
</div>
<div id="outline-container-org9f46ebd" class="outline-4">
<h4 id="org9f46ebd"><span class="section-number-4">18.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-18-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orgf4477c5" class="outline-4">
<h4 id="orgf4477c5"><span class="section-number-4">18.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-18-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
